Andydingbing/SPC5/include/reg_def.h
#ifndef INCLUDE_REG_DEF_H
#define INCLUDE_REG_DEF_H

#define CONFIG_FILE_PATH "config.ini"

#include "stdint_common.h"

// 1 address
// union reg0x....{
//      uint32_t u32;
// 	struct reg_t{
//          ...;
//          ...;
// 	} r;
// };

#define REG_DEF_S(addr) \
    union reg##addr { \
        uint32_t u32; \
        struct reg_t {

#define REG_DEF_E \
        } r; \
    };

#define REG_DECLARE(ns,addr) union ns::reg##addr ns##r##addr = { 0 };
#define REG(ns,addr) ns##r##addr.r
#define REG_U32(ns,addr) ns##r##addr.u32
#define REG_CLEAR(ns,addr) ns##r##addr.u32 = 0;

#define K7_OP(ns,addr) K7OP(ns,addr,op)
#define K7_OP_DELAY(ns,addr,time) K7OP_DELAY(ns,addr,op,time)
#define K7_RE(ns,addr) K7RE(ns,addr,op)
#define K7_FE(ns,addr) K7FE(ns,addr,op)
#define K7_WAIT_IDLE(ns,addr,flag,times) K7WAIT_IDLE(ns,addr,busy,flag,times)
#define K7_WAIT_IDLE_BUSY2(ns,addr,flag,times) K7WAIT_IDLE(ns,addr,busy2,flag,times)
#define S6_OP(ns,addr) S6OP(ns,addr,op)
#define S6_WAIT_FIFO_EMPTY(ns,addr,flag,times) S6WAIT_FIFO_EMPTY(ns,addr,fifo_prog_full,flag,times)

#ifdef _DEBUG
#define K7_ASSERT() \
    if (NULL == m_k7) { \
        Log.set_last_err("device:k7 disconnect"); \
        return -1; \
    }

#define S6_ASSERT() \
    if (NULL == m_s6) { \
        Log.set_last_err("device:s6 disconnect"); \
        return -1; \
    }
#else
#define K7_ASSERT()
#define S6_ASSERT()
#endif

#define K7_W(ns,addr) \
    do {K7_ASSERT(); \
        int32_t ret = 0; \
        if ((ret = m_k7->w32(pci_dev::AS_BAR0,uint16_t(addr<<2),REG_U32(ns,addr)))) { \
            Log.set_last_err("%s:%s line%d",__FILE__,__FUNCTION__,__LINE__); \
            return -1; \
        } \
        Log.add_reg(ret,m_k7->descriptor(),addr,REG_U32(ns,addr)); \
    }while (0);

#define K7_R(ns,addr) \
    do {K7_ASSERT(); \
        int32_t ret = 0; \
        if ((ret = m_k7->r32(pci_dev::AS_BAR0,uint16_t(addr<<2),&REG_U32(ns,addr)))) { \
            Log.set_last_err("%s:%s line%d",__FILE__,__FUNCTION__,__LINE__); \
            return -1; \
        } \
        Log.add_reg(ret,m_k7->descriptor(),addr,0xffffffff,REG_U32(ns,addr)); \
    }while (0);

#define K7OP(ns,addr,bit) \
    do {REG(ns,addr).bit = 0; \
        K7_W(ns,addr); \
        REG(ns,addr).bit = 1; \
        K7_W(ns,addr); \
        K7_W(ns,addr); \
        K7_W(ns,addr); \
        K7_W(ns,addr); \
        K7_W(ns,addr); \
        K7_W(ns,addr); \
        K7_W(ns,addr); \
        K7_W(ns,addr); \
        REG(ns,addr).bit = 0; \
        K7_W(ns,addr); \
    }while (0);

#define K7RE(ns,addr,bit) \
    do {REG(ns,addr).bit = 0; \
        K7_W(ns,addr); \
        REG(ns,addr).bit = 1; \
        K7_W(ns,addr); \
    }while (0);

#define K7FE(ns,addr,bit) \
    do {REG(ns,addr).bit = 1; \
        K7_W(ns,addr); \
        REG(ns,addr).bit = 0; \
        K7_W(ns,addr); \
    }while (0);

#define K7WAIT_IDLE(ns,addr,bit,flag,times) \
    do {bool idle = false; \
        K7_R(ns,addr); \
        for (int32_t i = 0;i < times;i ++) { \
            if (flag == REG(ns,addr).bit) { \
                idle = true; \
                break; \
            } \
            K7_R(ns,addr); \
        } \
        if (!idle) { \
            Log.set_last_err("reg%#06x wait idle timeout",addr); \
            return -1; \
        } \
    } while (0);

#define S6WAIT_FIFO_EMPTY(ns,addr,bit,flag,times) \
    do {bool full = true; \
        RFU_S6_R(addr);	\
        for (int32_t i = 0;i < times;i ++) { \
            if (flag != REG(ns,addr).bit) { \
                full = false; \
                break; \
            } \
        } \
        if (full) { \
            Log.set_last_err("reg%#06x wait fifo empty timeout",addr); \
            return -1; \
        } \
    } while (0);

#define S6OP(ns,addr,bit) \
    do {REG(ns,addr).bit = 0; \
        S6_W(ns,addr); \
        REG(ns,addr).bit = 1; \
        S6_W(ns,addr); \
        S6_W(ns,addr); \
        S6_W(ns,addr); \
        S6_W(ns,addr); \
        S6_W(ns,addr); \
        S6_W(ns,addr); \
        S6_W(ns,addr); \
        S6_W(ns,addr); \
        REG(ns,addr).bit = 0; \
        S6_W(ns,addr); \
    }while (0);

#define S6_W(ns,addr) \
    do {S6_ASSERT(); \
        int32_t ret = 0; \
        if ((ret = m_s6->w32(pci_dev::AS_BAR0,uint16_t(addr <<2),REG_U32(ns,addr)))) { \
            Log.set_last_err("%s:%s line%d",__FILE__,__FUNCTION__,__LINE__); \
            return -1; \
        } \
        Log.add_reg(ret,m_s6->descriptor(),addr,REG_U32(ns,addr)); \
    }while (0);

#define S6_R(ns,addr) \
    do {S6_ASSERT(); \
        int32_t ret = 0; \
        if ((ret = m_s6->r32(pci_dev::AS_BAR0,uint16_t(addr <<2),&REG_U32(ns,addr)))) { \
            Log.set_last_err("%s:%s line%d",__FILE__,__FUNCTION__,__LINE__); \
            return -1; \
        } \
        Log.add_reg(ret,m_s6->descriptor(),addr,-1,REG_U32(ns,addr)); \
    }while (0);

#define RFU_K7_REG_DECLARE(addr) REG_DECLARE(ns_reg_rfu_k7,addr)
#define RFU_K7_REG(addr) REG(ns_reg_rfu_k7,addr)
#define RFU_K7_REG_U32(addr) REG_U32(ns_reg_rfu_k7,addr)
#define RFU_K7_REG_CLEAR(addr) REG_CLEAR(ns_reg_rfu_k7,addr)
#define RFU_K7OP(addr,bit) K7OP(ns_reg_rfu_k7,addr,bit)
#define RFU_K7_OP(addr) K7_OP(ns_reg_rfu_k7,addr)
#define RFU_K7_OP_DELAY(addr,time) K7_OP_DELAY(ns_reg_rfu_k7,addr,time)
#define RFU_K7_RE(addr) K7_RE(ns_reg_rfu_k7,addr)
#define RFU_K7_FE(addr) K7_FE(ns_reg_rfu_k7,addr)
#define RFU_K7_WAIT_IDLE(addr,flag,times) K7_WAIT_IDLE(ns_reg_rfu_k7,addr,flag,times)
#define RFU_K7_WAIT_IDLE_BUSY2(addr,flag,times) K7_WAIT_IDLE_BUSY2(ns_reg_rfu_k7,addr,flag,times)
#define RFU_K7_W(addr) K7_W(ns_reg_rfu_k7,addr)
#define RFU_K7_R(addr) K7_R(ns_reg_rfu_k7,addr)
#define RFU_S6_REG_DECLARE(addr) REG_DECLARE(ns_reg_rfu_s6,addr)
#define RFU_S6_REG(addr) REG(ns_reg_rfu_s6,addr)
#define RFU_S6_REG_U32(addr) REG_U32(ns_reg_rfu_s6,addr)
#define RFU_S6_REG_CLEAR(addr) REG_CLEAR(ns_reg_rfu_s6,addr)
#define RFU_S6_OP(addr) S6_OP(ns_reg_rfu_s6,addr)
#define RFU_S6_WAIT_FIFO_EMPTY(addr,flag,times) S6_WAIT_FIFO_EMPTY(ns_reg_rfu_s6,addr,flag,times)
#define RFU_S6_W(addr) S6_W(ns_reg_rfu_s6,addr)
#define RFU_S6_R(addr) S6_R(ns_reg_rfu_s6,addr)
#define CXU_S6_REG_DECLARE(addr) REG_DECLARE(ns_reg_cxu_s6,addr)
#define CXU_S6_REG(addr) REG(ns_reg_cxu_s6,addr)
#define CXU_S6_REG_U32(addr) REG_U32(ns_reg_cxu_s6,addr)
#define CXU_S6_REG_CLEAR(addr) REG_CLEAR(ns_reg_cxu_s6,addr)
#define CXU_S6_OP(addr) S6_OP(ns_reg_cxu_s6,addr)
#define CXU_S6_W(addr) S6_W(ns_reg_cxu_s6,addr)
#define CXU_S6_R(addr) S6_R(ns_reg_cxu_s6,addr)


