Andydingbing/SPC5/include/reg_def.h
// 2 addresses
// struct reg0x....0x...._t {
//      uint32_t addr[4];
//      union reg {
//          uint32_t u32;
//          struct r_t {
//              ...;
//              ...;
//          } r;
//      };
//      union reg data;
// };

#define REG_DEF_S_2(addr0,addr1) \
    struct reg##addr0##addr1##_t { \
        uint32_t addr[4]; \
        union reg { \
            uint32_t u32; \
            struct r_t {

#define REG_DEF_E_2 \
            } r; \
        }; \
        union reg data; \
    };

#define REG_DECLARE_2(ns,addr0,addr1) \
    struct ns::reg##addr0##addr1##_t ns##r##addr0##addr1 = {{addr1,addr0,addr1,addr0},{0}};
#define REG_2(ns,addr0,addr1) ns##r##addr0##addr1.data.r
#define REG_U32_2(ns,addr0,addr1) ns##r##addr0##addr1.data.u32
#define REG_CLEAR_2(ns,addr0,addr1) ns##r##addr0##addr1.data.u32 = 0;

#define K7_OP_2(ns,addr0,addr1) K7OP_2(ns,addr0,addr1,op)
#define K7_OP_DELAY_2(ns,addr0,addr1,time) K7OP_DELAY_2(ns,addr0,addr1,op,time)
#define K7_WAIT_IDLE_2(ns,addr0,addr1,flag,times) K7WAIT_IDLE_2(ns,addr0,addr1,busy,flag,times)
#define S6_WAIT_FIFO_EMPTY_2(ns,addr0,addr1,flag,times) S6WAIT_FIFO_EMPTY_2(ns,addr0,addr1,fifo_prog_full,flag,times)

#define K7_W_2(ns,addr0,addr1) \
    do {K7_ASSERT(); \
        int32_t ret = 0; \
        uint32_t addr = ns##r##addr0##addr1.addr[get_rf_idx()]; \
        if ((ret = m_k7->w32(pci_dev::AS_BAR0,addr<<2,REG_U32_2(ns,addr0,addr1)))) { \
            Log.set_last_err("%s:%s line%d",__FILE__,__FUNCTION__,__LINE__); \
            return -1; \
        } \
        Log.add_reg(ret,m_k7->descriptor(),addr,REG_U32_2(ns,addr0,addr1)); \
    }while (0);

#define K7_R_2(ns,addr0,addr1) \
    do {K7_ASSERT(); \
        int32_t ret = 0; \
        uint32_t addr = ns##r##addr0##addr1.addr[get_rf_idx()]; \
        if ((ret = m_k7->r32(pci_dev::AS_BAR0,addr<<2,&REG_U32_2(ns,addr0,addr1)))) { \
            Log.set_last_err("error in %s: func:%s line%d",__FILE__,__FUNCTION__,__LINE__); \
            return -1; \
        } \
        Log.add_reg(ret,m_k7->descriptor(),addr,0xffffffff,REG_U32_2(ns,addr0,addr1)); \
    }while (0);

#define K7OP_2(ns,addr0,addr1,bit) \
    do {REG_2(ns,addr0,addr1).bit = 0; \
        K7_W_2(ns,addr0,addr1); \
        REG_2(ns,addr0,addr1).bit = 1; \
        K7_W_2(ns,addr0,addr1); \
        K7_W_2(ns,addr0,addr1); \
        K7_W_2(ns,addr0,addr1); \
        K7_W_2(ns,addr0,addr1); \
        K7_W_2(ns,addr0,addr1); \
        K7_W_2(ns,addr0,addr1); \
        K7_W_2(ns,addr0,addr1); \
        K7_W_2(ns,addr0,addr1); \
        REG_2(ns,addr0,addr1).bit = 0; \
        K7_W_2(ns,addr0,addr1); \
    } while (0);

#define K7OP_DELAY_2(ns,addr0,addr1,bit,time) \
    do { \
        if (time) { sleep_ms(time); } \
        REG_2(ns,addr0,addr1).bit = 0; \
        K7_W_2(ns,addr0,addr1); \
        if (time) { sleep_ms(time); } \
        REG_2(ns,addr0,addr1).bit = 1; \
        K7_W_2(ns,addr0,addr1); \
        if (time) { sleep_ms(time); } \
        REG_2(ns,addr0,addr1).bit = 0; \
        K7_W_2(ns,addr0,addr1); \
    } while (0);

#define K7WAIT_IDLE_2(ns,addr0,addr1,bit,flag,times) \
    do {bool idle = false; \
        uint32_t addr = ns##r##addr0##addr1.addr[get_rf_idx()]; \
        K7_R_2(ns,addr0,addr1); \
        for (int32_t i = 0;i < times;i ++) { \
            if (flag == REG_2(ns,addr0,addr1).bit) { \
                idle = true; \
                break; \
            } \
            K7_R_2(ns,addr0,addr1); \
        } \
        if (!idle) { \
            Log.set_last_err("reg%#06x wait idle timeout",addr); \
            return -1; \
        } \
    } while (0);

#define S6WAIT_FIFO_EMPTY_2(ns,addr0,addr1,bit,flag,times) \
    do {bool full = true; \
        uint32_t addr = ns##r##addr0##addr1.addr[get_rf_idx()/2]; \
        RFU_S6_R_2(addr0,addr1); \
        for (int32_t i = 0;i < times;i ++) { \
            if (flag != REG_2(ns,addr0,addr1).bit) { \
                full = false; \
                break; \
            } \
        } \
        if (full) { \
            Log.set_last_err("reg %#06x wait fifo empty timeout",addr); \
            return -1; \
        } \
    } while (0);

#define S6_W_2(ns,addr0,addr1) \
    do {S6_ASSERT(); \
        int32_t ret = 0; \
        uint32_t addr = ns##r##addr0##addr1.addr[get_rf_idx()/2]; \
        if ((ret = m_s6->w32(pci_dev::AS_BAR0,addr<<2,REG_U32_2(ns,addr0,addr1)))) { \
            Log.set_last_err("%s:%s line%d",__FILE__,__FUNCTION__,__LINE__); \
            return -1; \
        } \
        Log.add_reg(ret,m_s6->descriptor(),addr,REG_U32_2(ns,addr0,addr1)); \
    }while (0);

#define S6_R_2(ns,addr0,addr1) \
    do {S6_ASSERT(); \
        int32_t ret = 0; \
        uint32_t addr = ns##r##addr0##addr1.addr[get_rf_idx()/2]; \
        if ((ret = m_s6->r32(pci_dev::AS_BAR0,addr<<2,&REG_U32_2(ns,addr0,addr1)))) { \
            Log.set_last_err("%s:%s line%d",__FILE__,__FUNCTION__,__LINE__); \
            return -1; \
        } \
        Log.add_reg(ret,m_s6->descriptor(),addr,-1,REG_U32_2(ns,addr0,addr1)); \
    }while (0);

#define RFU_K7_REG_DECLARE_2(addr0,addr1) REG_DECLARE_2(ns_reg_rfu_k7,addr0,addr1)
#define RFU_K7_REG_2(addr0,addr1) REG_2(ns_reg_rfu_k7,addr0,addr1)
#define RFU_K7_REG_U32_2(addr0,addr1) REG_U32_2(ns_reg_rfu_k7,addr0,addr1)
#define RFU_K7_REG_CLEAR_2(addr0,addr1) REG_CLEAR_2(ns_reg_rfu_k7,addr0,addr1)
#define RFU_K7OP_2(addr0,addr1,bit) K7OP_2(ns_reg_rfu_k7,addr0,addr1,bit)
#define RFU_K7_OP_2(addr0,addr1) K7_OP_2(ns_reg_rfu_k7,addr0,addr1)
#define RFU_K7_OP_DELAY_2(addr0,addr1,time) K7_OP_DELAY_2(ns_reg_rfu_k7,addr0,addr1,time)
#define RFU_K7_WAIT_IDLE_2(addr0,addr1,flag,times) K7_WAIT_IDLE_2(ns_reg_rfu_k7,addr0,addr1,flag,times)
#define RFU_K7_W_2(addr0,addr1) K7_W_2(ns_reg_rfu_k7,addr0,addr1)
#define RFU_K7_R_2(addr0,addr1) K7_R_2(ns_reg_rfu_k7,addr0,addr1)
#define RFU_S6_REG_DECLARE_2(addr0,addr1) REG_DECLARE_2(ns_reg_rfu_s6,addr0,addr1)
#define RFU_S6_REG_2(addr0,addr1) REG_2(ns_reg_rfu_s6,addr0,addr1)
#define RFU_S6_REG_U32_2(addr0,addr1) REG_U32_2(ns_reg_rfu_s6,addr0,addr1)
#define RFU_S6_WAIT_FIFO_EMPTY_2(addr0,addr1,flag,times) S6_WAIT_FIFO_EMPTY_2(ns_reg_rfu_s6,addr0,addr1,flag,times)
#define RFU_S6_W_2(addr0,addr1) S6_W_2(ns_reg_rfu_s6,addr0,addr1)
#define RFU_S6_R_2(addr0,addr1) S6_R_2(ns_reg_rfu_s6,addr0,addr1)

