Andydingbing/SPC5/include/reg_def.h
// Register Define

// RFU K7
namespace ns_reg_rfu_k7 {

REG_DEF_S(0x0000)
    unsigned op   : 1;	// DMA state-machine reset signal
    unsigned rsv  : 7;
    unsigned ver  : 8;	// firmware version
    unsigned cdw  : 4;
#define cdw_invalid 0
#define cdw_32      1
#define cdw_64      2
#define cdw_128     3
REG_DEF_E

REG_DEF_S(0x0001)
    unsigned fpga_wr_op   : 1; // FPGA DMA write start signal
    unsigned rsv          : 6;
    unsigned dis_wr_int   : 1; // disable FPGA DMA write interruption
    unsigned fpga_wr_done : 1; // FPGA DMA write done
    unsigned rsv2         : 7;

    unsigned fpga_rd_op   : 1; // FPGA DMA read start signal
    unsigned rsv3         : 6;
    unsigned dis_rd_int   : 1; // disable FPGA DMA read interruption
    unsigned fpga_rd_done : 1; // FPGA DMA read done
    unsigned rsv4         : 7;
REG_DEF_E

REG_DEF_S(0x0002)
    unsigned op    : 1;  // FPGA reset signal
    unsigned rsv0  : 3;
    unsigned ld_da : 1;  // ADF4351(to DAC) lock detect
    unsigned rsv1  : 3;
    unsigned ld_ad : 1;  // ADF4351(to ADC) lock detect
    unsigned rsv   : 23;
REG_DEF_E

REG_DEF_S(0x0007)
    unsigned adr : 32; // FPGA DMA read physical address
REG_DEF_E

REG_DEF_S(0x0008)
    unsigned tlp_size : 16; // FPGA DMA read TLP size
REG_DEF_E

REG_DEF_S(0x0009)
    unsigned tlp_count : 20; // FPGA DMA read TLP count
REG_DEF_E

REG_DEF_S(0x0014)
    unsigned samples : 32; // FPGA DMA write total samples written
REG_DEF_E

REG_DEF_S(0x0016)
    unsigned data : 32; // FPGA DMA write physical memory block index
REG_DEF_E

REG_DEF_S(0x0017)
    unsigned adr : 32; // FPGA DMA write physical memory block address
REG_DEF_E

REG_DEF_S(0x0020)
    unsigned dma_rd_timer : 32; // FPGA DMA read timer
REG_DEF_E

REG_DEF_S(0x0021)
    unsigned dma_rd_counter : 32; // FPGA DMA read counter
REG_DEF_E

REG_DEF_S(0x0025)
    unsigned rsv0 : 23;
    unsigned op_0 : 1;  // Meas capture start,freerun/waiting for trigger.
    unsigned op_1 : 1;  // FPGA write start.
    unsigned rsv1 : 7;
REG_DEF_E

REG_DEF_S(0x0027)                       //! ddr status
    unsigned rsv : 16;
    unsigned busy : 1;                  //! fpga begin transfer data to ddr,default 1(busy)
    unsigned rsv1 : 7;
    unsigned busy2 : 1;                 //! fpga data transfer to ddr end,default 1(busy)
    unsigned rsv2 : 6;
REG_DEF_E

REG_DEF_S(0x0028)
    unsigned addr : 29;			//! fpga dma read/write begin address
    unsigned rsv  : 1;
    unsigned flag : 2;			//! fpga dma read/write flag,//b00:fpga read	//b01:fpga write
REG_DEF_E

REG_DEF_S(0x0030)
     unsigned busy : 1; // FPGA write trans ready signal.
REG_DEF_E

REG_DEF_S(0x0031)
     unsigned ddr_addr : 32;            //!by byf
REG_DEF_E

REG_DEF_S(0x002f)
    unsigned samples : 32;		//! fpga dma read total samples
REG_DEF_E

REG_DEF_S(0x0035)
    unsigned op	   : 1;			//! ad/da freq en
    unsigned rsv   : 1;
    unsigned ad_da : 1;			//! ad/da select
REG_DEF_E

REG_DEF_S(0x0036)
    unsigned freq_frac : 8;		//! ad/da freq frac,default da:491.52MHz,ad:368.64MHz
    unsigned freq_int  : 10;		//! ad/da freq int             0x1eb34,	  0x17040
    unsigned rsv       : 14;
REG_DEF_E

REG_DEF_S_2(0x0061,0x2061)		//! tx dc offset
    unsigned i : 16;
    unsigned q : 16;
REG_DEF_E_2

REG_DEF_S_2(0x0067,0x2067)		//! tx amplitude balance
    unsigned i : 16;
    unsigned q : 16;
REG_DEF_E_2

REG_DEF_S_2(0x006a,0x206a)		//! tx i phase rotate
    unsigned cos : 16;
    unsigned sin : 16;
REG_DEF_E_2

REG_DEF_S_2(0x0072,0x2072)		//! tx baseband data source
    unsigned bb_tx_source : 3;		//! b000:all 0  //b001:inter filter  //b010:all 1  //b011:dds single tone //b100:dds two tone  //b101:arb in ddr  //b110:ddr3
REG_DEF_E_2

REG_DEF_S_2(0x0079,0x2079)
    unsigned dds1_op : 1;		//! dds1 freq en
    unsigned dds2_op : 1;		//! dds2 freq en
REG_DEF_E_2

REG_DEF_S_2(0x007a,0x207a)
    unsigned freq : 32;			//! dds1 freq,32L
REG_DEF_E_2

REG_DEF_S_2(0x00e9,0x20e9)
    unsigned freq : 32;			//! dds1 freq,32H
REG_DEF_E_2

REG_DEF_S_2(0x00ea,0x20ea)
    unsigned freq : 32;			//! dds2 freq,32L
REG_DEF_E_2

REG_DEF_S_2(0x00eb,0x20eb)
    unsigned freq : 32;			//! dds2 freq,32H
REG_DEF_E_2

REG_DEF_S_2(0x007b,0x207b)
    unsigned op : 1;			//! duc en
REG_DEF_E_2

REG_DEF_S_2(0x007c,0x207c)
    unsigned duc : 32;			//! duc freq,32L
REG_DEF_E_2

REG_DEF_S_2(0x00e8,0x20e8)
    unsigned duc : 32;			//! duc freq,32H
REG_DEF_E_2

REG_DEF_S_2(0x007d,0x207d)
    unsigned op : 1;			//! ddc en
REG_DEF_E_2

REG_DEF_S_2(0x007e,0x207e)
    unsigned ddc : 32;			//! ddc freq,32L
REG_DEF_E_2

REG_DEF_S_2(0x00e7,0x20e7)
    unsigned ddc : 32;			//! ddc freq,32H
REG_DEF_E_2

REG_DEF_S_2(0x0085,0x2085)
    unsigned dds1_amp : 16;		//! dds1 amplitude
    unsigned dds2_amp : 16;		//! dds2 amplitude
REG_DEF_E_2

REG_DEF_S_2(0x0094,0x2094)		//! tx power compensate
    unsigned i : 16;
    unsigned q : 16;
REG_DEF_E_2

REG_DEF_S_2(0x00b9,0x20b9)
    unsigned iq_avg : 32;		//! rx power(dc)
REG_DEF_E_2

REG_DEF_S_2(0x00e4,0x20e4)
    unsigned ratio : 16;		//! rx power compensate
REG_DEF_E_2

REG_DEF_S_2(0x00e5,0x20e5)
    unsigned op : 1;			//! get rx power(dc) en
    unsigned busy : 1;			//! get rx power(dc) busy
REG_DEF_E_2

REG_DEF_S_2(0x00e6,0x20e6)		//! sync set tx gain
    unsigned op_0 : 4;
    unsigned op_1 : 4;
REG_DEF_E_2

REG_DEF_S_2(0x00ec,0x20ec)
    unsigned op  : 1;			//! tx 2 interpolation fir filter each coef en
    unsigned rsv : 31;
REG_DEF_E_2

REG_DEF_S_2(0x00ed,0x20ed)
    unsigned addr : 16;			//! tx 2 interpolation fir filter each coef address
    unsigned rsv  : 16;
REG_DEF_E_2

REG_DEF_S_2(0x00ee,0x20ee)
    unsigned sum : 16;                  //! tx 2 interpolation fir filter each coef real + imag
    unsigned rsv : 16;
REG_DEF_E_2

REG_DEF_S_2(0x00ef,0x20ef)
    unsigned real : 16;			//! tx 2 interpolation fir filter each coef real
    unsigned rsv  : 16;
REG_DEF_E_2

REG_DEF_S_2(0x00f0,0x20f0)
    unsigned imag : 16;			//! tx 2 interpolation fir filter each coef imag
    unsigned rsv  : 16;
REG_DEF_E_2

