Andydingbing/SPC5/include/reg_def.h
REG_DEF_S_2(0x00f1,0x20f1)
    unsigned op  : 1;			//! tx 2 interpolation fir filter coef to ram en
    unsigned rsv : 31;
REG_DEF_E_2

REG_DEF_S_2(0x00f2,0x20f2)
    unsigned op  : 1;			//! rx 3 decimation fir filter each coef en
    unsigned rsv : 31;
REG_DEF_E_2

REG_DEF_S_2(0x00f3,0x20f3)
    unsigned addr : 16;			//! rx 3 decimation fir filter each coef address
    unsigned rsv  : 16;
REG_DEF_E_2

REG_DEF_S_2(0x00f4,0x20f4)
    unsigned sum : 16;			//! rx 3 decimation fir filter each coef real + imag
    unsigned rsv : 16;
REG_DEF_E_2

REG_DEF_S_2(0x00f5,0x20f5)
    unsigned real : 16;			//! rx 3 decimation fir filter each coef real
    unsigned rsv  : 16;
REG_DEF_E_2

REG_DEF_S_2(0x00f6,0x20f6)
    unsigned imag : 16;			//! rx 3 decimation fir filter each coef imag
    unsigned rsv  : 16;
REG_DEF_E_2

REG_DEF_S_2(0x00f7,0x20f7)
    unsigned op  : 1;			//! rx 3 decimation fir filter coef to ram en
    unsigned rsv : 31;
REG_DEF_E_2

REG_DEF_S_2(0x00f8,0x20f8)
    unsigned filter : 1;		//! rx fir filter select : 0:3d;1:2i3d
REG_DEF_E_2

REG_DEF_S_2(0x00f9,0x20f9)
    unsigned filter : 1;		//! rx fir filter select : 0:2i3d;1:3d	//reserved
REG_DEF_E_2

REG_DEF_S_2(0x00fa,0x20fa)
    unsigned en : 1;			//! tx filter en
REG_DEF_E_2

REG_DEF_S_2(0x00ff,0x20ff)		//! tx & rx fir filter truncation digit,both default 14(0xe)
    unsigned digit_tx : 4;
    unsigned rsv      : 12;
    unsigned digit_rx : 4;
    unsigned rsv2     : 12;
REG_DEF_E_2

REG_DEF_S_2(0x0502,0x0602)
    unsigned repetition : 1;		//!
    unsigned cycles     : 12;
    unsigned rsv	: 2;
    unsigned addition   : 17;
REG_DEF_E_2

REG_DEF_S_2(0x0503,0x0603)
    unsigned adr : 5;
    unsigned seg : 6;
    unsigned rsv : 20;
    unsigned op  : 1;
REG_DEF_E_2

REG_DEF_S_2(0x0504,0x0604)
    unsigned data : 32;
REG_DEF_E_2

REG_DEF_S_2(0x0505,0x0605)
    unsigned seg : 7;
    unsigned rsv : 25;
REG_DEF_E_2

REG_DEF_S_2(0x0506,0x0606)
    unsigned samples : 31;
    unsigned rsv     : 1;
REG_DEF_E_2

REG_DEF_S_2(0x0507,0x0607)
    unsigned adr : 32;
REG_DEF_E_2

REG_DEF_S_2(0x0508,0x0608)
    unsigned comp : 1;
    unsigned rsv  : 7;
    unsigned arb  : 1;
    unsigned rsv2 : 23;
REG_DEF_E_2

REG_DEF_S_2(0x0509,0x0609)
    unsigned apc	: 1;
    unsigned rsv	: 7;
    unsigned en		: 1;
    unsigned rsv2	: 22;
    unsigned abort  : 1;
REG_DEF_E_2

REG_DEF_S_2(0x050a,0x060a)
    unsigned delay      : 27;
    unsigned src        : 3;
    unsigned autostart  : 1;
    unsigned retrig     : 1;
REG_DEF_E_2

REG_DEF_S_2(0x050b,0x060b)
    unsigned rsv  : 1;
    unsigned op	  : 1;
    unsigned rsv2 : 30;
REG_DEF_E_2

REG_DEF_S_2(0x050c,0x060c)
    unsigned ms_rm   : 2;
    unsigned ms_trig : 2;
    unsigned rsv     : 28;
REG_DEF_E_2

REG_DEF_S_2(0x050d,0x060d)
    unsigned next_seg : 6;
    unsigned rsv      : 25;
    unsigned op       : 1;
REG_DEF_E_2

REG_DEF_S_2(0x050e,0x060e)
    unsigned seg : 6;
    unsigned rsv : 26;
REG_DEF_E_2

REG_DEF_S_2(0x0510,0x0610)
    unsigned op  : 1;
    unsigned rsv : 31;
REG_DEF_E_2

REG_DEF_S_2(0x0511,0x0611)
    unsigned offset : 32;
REG_DEF_E_2

REG_DEF_S_2(0x0533,0x0633)		//! marker1
    unsigned adr : 10;
    unsigned rsv : 21;
    unsigned op  : 1;
REG_DEF_E_2

REG_DEF_S_2(0x0534,0x0634)
    unsigned data : 32;
REG_DEF_E_2

REG_DEF_S_2(0x0535,0x0635)		//! marker2
    unsigned adr : 10;
    unsigned rsv : 21;
    unsigned op  : 1;
REG_DEF_E_2

REG_DEF_S_2(0x0536,0x0636)
    unsigned data : 32;
REG_DEF_E_2

REG_DEF_S_2(0x0537,0x0637)		//! marker3
    unsigned adr : 10;
    unsigned rsv : 21;
    unsigned op  : 1;
REG_DEF_E_2

REG_DEF_S_2(0x0538,0x0638)
    unsigned data : 32;
REG_DEF_E_2

REG_DEF_S_2(0x0539,0x0639)		//! marker4
    unsigned adr : 10;
    unsigned rsv : 21;
    unsigned op  : 1;
REG_DEF_E_2

REG_DEF_S_2(0x053a,0x063a)
    unsigned data : 32;
REG_DEF_E_2

REG_DEF_S_2(0x053d,0x063d)
    unsigned delay2 : 16;
    unsigned delayr : 16;
REG_DEF_E_2

REG_DEF_S_2(0x053e,0x063e)
    unsigned delay4 : 16;
    unsigned delay3 : 16;
REG_DEF_E_2

REG_DEF_S_2(0x0540,0x0640)
    unsigned sample : 32;
REG_DEF_E_2

REG_DEF_S_2(0x0541,0x0641)
    unsigned cycle : 12;
    unsigned rsv   : 20;
REG_DEF_E_2

REG_DEF_S_2(0x0542,0x0642)
    unsigned time_h : 32;
REG_DEF_E_2

REG_DEF_S_2(0x0543,0x0643)
    unsigned time_l : 32;
REG_DEF_E_2

REG_DEF_S(0x0544)
    unsigned inter : 10;
REG_DEF_E

REG_DEF_S(0x0545)
    /*!
     * frame_trig_src :
     * 5G 10ms radio frame trigger mode select signal
     * 0 : trigger in(trigger from CXU right now)
     * 1 : trigger out(internal trigger source),default
     *
     * hyper_frame_trig_src :
     * 5G 10s(1024 * 10ms) hyper radio frame trigger source select signal
     * 0 : trigger in(trigger from CXU right now)
     * 1 : trigger out(internal trigger source),default
     *
     * frame_trig_in_offset :
     * frame_trig_src trigger in mode trigger offset select signal
     * 0 : offset 0
     * 1 : offset enable
     *
     * hyper_frame_trig_in_offset :
     * hyper_frame_trig_src trigger in mode trigger offset select signal
     * 0 : offset 0
     * 1 : offset enable
     *
     * frame_trig_out_offset :
     * frame_trig_src trigger out mode trigger offset select signal
     * 0 : offset 0
     * 1 : offset enable
     *
     * hyper_frame_trig_out_offset :
     * hyper_frame_trig_src trigger out mode trigger offset select signal
     * 0 : offset 0
     * 1 : offset enable
     */
    unsigned frame_trig_mode                : 1;
    unsigned hyper_frame_trig_mode          : 1;
    unsigned frame_trig_in_offset           : 1;
    unsigned hyper_frame_trig_in_offset     : 1;
    unsigned frame_trig_out_offset          : 1;
    unsigned hyper_frame_trig_out_offset    : 1;
    unsigned rsv                            : 26;
REG_DEF_E

REG_DEF_S(0x0546)
    /*!
     * frame_time :
     * 5G frame length,default 10ms(24'h258000)
     * algorithm : frame_time = time * 245.76e6
     * e.g. 10ms : 10e-3 * 245.76e6 = 2457600(24'h258000)
     *
     * frame_pluse_width :
     * the trigger minimum width of high level,default 8'hFF
     */
    unsigned frame_time         : 24;
    unsigned frame_pluse_width  : 8;
REG_DEF_E

