Andydingbing/SPC5/include/reg_def.h
REG_DEF_S_2(0x1832,0x2832)		//! r1c/d 3208
    unsigned addr : 3;
    unsigned op   : 1;
    unsigned rsv  : 4;
    unsigned busy : 1;
REG_DEF_E_2

REG_DEF_S_2(0x1833,0x2833)
    unsigned ad : 12;			//! r1c/d 3208 spi read data
REG_DEF_E_2

REG_DEF_S_2(0x1835,0x2835)
    unsigned filter : 1;                //! r1d tx lo2 filter sw
REG_DEF_E_2

REG_DEF_S_2(0x1836,0x2836)		//! r1c/d hmc1197 spi hmc mode
    unsigned addr : 8;
    unsigned wr	  : 1;
    unsigned op	  : 1;
    unsigned busy : 1;
REG_DEF_E_2

REG_DEF_S_2(0x1837,0x2837)
    unsigned data : 24;			//! r1c/d hmc1197 spi hmc mode write data
REG_DEF_E_2

REG_DEF_S_2(0x1838,0x2838)
    unsigned data : 24;			//! r1c/d hmc1197 spi hmc mode read data
REG_DEF_E_2

REG_DEF_S_2(0x1839,0x2839)
    unsigned busy : 1;
    unsigned rsv0 : 1;
    unsigned rb   : 1;  // Read back the CFG register
    unsigned seq  : 2;  // Channel sequencer
    unsigned ref  : 3;  // Reference/buffer selection
    unsigned bw   : 1;  // Select bandwidth for low-pass filter
    unsigned in   : 3;  // Input channel selection in binary fashion
    unsigned incc : 3;  // Input channel configuration
    unsigned cfg  : 1;  // Configuration update
    unsigned rsv1 : 15;
    unsigned op   : 1;
REG_DEF_E_2

REG_DEF_S_2(0x1840,0x2840)
    unsigned ad   : 14;
    unsigned rsv  : 18;
REG_DEF_E_2

}

//rfu s6
namespace ns_reg_rfu_s6 {

REG_DEF_S(0x0000)
    unsigned ver : 32;			//! firmware ver
REG_DEF_E

REG_DEF_S(0x0001)
    unsigned op : 1;			//! CDCE62005 reconfig
REG_DEF_E

REG_DEF_S_2(0x0002,0x0006)
    unsigned PROGRAM_B : 1;
REG_DEF_E_2

REG_DEF_S_2(0x0003,0x0007)		//! program bit state
    unsigned pc_cfg_init    : 1;
    unsigned c_cfg_done	    : 1;
    unsigned fifo_prog_full : 1;	//! fifo full flag£¬0:full
    unsigned fifo_wr_en     : 1;	//! fifo write en
REG_DEF_E_2

REG_DEF_S_2(0x0004,0x0008)
    unsigned load_mode : 1;		//! 0:master spi mode,1:slave select map
REG_DEF_E_2

REG_DEF_S_2(0x0005,0x0009)
    unsigned buf : 32;			//! program bit data
REG_DEF_E_2

REG_DEF_S(0x000a)			//! ad sw rf/if
    unsigned rf_ch_3	: 1;
    unsigned reserved_3 : 3;
    unsigned rf_ch_2	: 1;
    unsigned reserved_2 : 3;
    unsigned rf_ch_1	: 1;
    unsigned reserved_1 : 3;
    unsigned rf_ch_0	: 1;
    unsigned reserved_0 : 3;
REG_DEF_E

REG_DEF_S(0x000b)			//! da sw rf/if
    unsigned rf_ch_3	: 1;
    unsigned reserved_3 : 3;
    unsigned rf_ch_2	: 1;
    unsigned reserved_2 : 3;
    unsigned rf_ch_1	: 1;
    unsigned reserved_1 : 3;
    unsigned rf_ch_0	: 1;
    unsigned reserved_0 : 3;
    unsigned rst	: 1;            //! da reset
REG_DEF_E

}

//cxu s6
namespace ns_reg_cxu_s6 {

REG_DEF_S(0x0000)
    unsigned ver : 32;			//! firmware ver
REG_DEF_E

REG_DEF_S(0x000e)
    unsigned op : 1;
REG_DEF_E

REG_DEF_S(0x000f)
    unsigned val : 10;			//! 9119 voltage
    unsigned sign : 1;
REG_DEF_E

REG_DEF_S(0x0012)
    unsigned speed  : 8;		//! blower speed
    unsigned addr   : 8;		//! address
    unsigned op     : 1;		//! blower en
    unsigned blower : 1;		//! blower select
REG_DEF_E

REG_DEF_S(0x0013)
    unsigned speed  : 8;		//! blower speed
    unsigned addr   : 8;		//! address
    unsigned op     : 1;		//! blower en
    unsigned blower : 1;		//! blower select
REG_DEF_E

}

using namespace ns_reg_rfu_k7;
using namespace ns_reg_rfu_s6;
using namespace ns_reg_cxu_s6;

#endif // INCLUDE_REG_DEF_H
